{
  "name": "JAHID HASSAN SHAMIM",
  "photo": "assets/image/jahidcs.jpg",
  "contact": {
    "email": "jahid.cseq@gmail.com",
    "phone": "+8801737880254",
    "linkedin": "linkedin.com/in/jahidcs",
    "github": "github.com/jahidcs",
    "portfolio": "jahidcs.github.io"
  },
  "profession": "Software Engineer",
  "bio": "I am a Software Engineer Passionate about Database Design and API development and System Design by working in a collaborative environment with a flexible nature of adopting, learning and implementing new things to fulfill the project demands. Have a strong ambition to work in the larger scale projects by following good practices for making systems efficient.",
  "resume_bio": "I am a backend-focused software engineer who enjoys building clean, scalable systems. I prioritize writing efficient code, designing clean, reliable APIs, and ensuring everything works well in production.",
  "skill": [
    {
      "category": "Language",
      "tools": ["Python", "JavaScript", "Dart"]
    },
    {
      "category": "Framework",
      "tools": ["Django", "FastAPI", "Flutter"]
    },
    {
      "category": "Database",
      "tools": ["PostgreSQL"]
    },
    {
      "category": "Cloud",
      "tools": ["AWS (EC2, RDS, S3)", "Github Actions"]
    }
  ],
  "experience": [
    {
      "organization": "Shpper Software Design FZCO",
      "org_short": "Shpper",
      "position": "Software Engineer",
      "start": "May 2024",
      "end": "Present",
      "type": "Full-time",
      "location": "Dhaka, Bangladesh",
      "detail": [
        "Led backend design and development of a cross-border product sourcing platform, delivering core features like buyer-driven requests, traveler listings, and real-time updates in a modular and maintainable architecture.",
        "Implemented dynamic workflows for cost calculation, location-based trip matching, and automated user onboarding, ensuring data consistency and high performance through optimized models and queries.",
        "Managed infrastructure migration and scaling; built real-time notification systems; and contributed to platform reliability by overseeing deployment and production operations."
      ]
    },
    {
      "organization": "eAppair LTD",
      "org_short": "eAppair",
      "position": "Python Developer",
      "start": "January 2024",
      "end": "April 2024",
      "type": "Full-time",
      "location": "Dhaka, Bangladesh",
      "detail": [
        "Collaborated on existing ERP system projects by preparing backend methods and writing SQL queries to generate reports for monitoring and evaluating sales force activities."
      ]
    },
    {
      "organization": "Winning Bees LLC",
      "org_short": "Winning Bees",
      "position": "Junior Software Engineer",
      "start": "April 2023",
      "end": "December 2023",
      "type": "Full-time",
      "location": "Remote",
      "detail": [
        "Contributed to 4 mobile projects including a content management app, a book app integrating Google Books API, a PDF reader with note-taking and PDF generation, and a referral system linked to app sharing.",
        "Gained backend development experience by contributing to 2 backend projects, building custom admin dashboards with CMS integration, designing databases, developing APIs, implementing background jobs, and securing endpoints with API keys."
      ]
    },
    {
      "organization": "Winning Bees LLC",
      "org_short": "Winning Bees",
      "position": "Intern Software Engineer",
      "start": "December 2022",
      "end": "March 2023",
      "type": "Internship",
      "location": "Remote",
      "detail": [
        "Built a solid foundation in cross-platform app development by learning Flutter, Firebase, and Riverpod as part of the internship program.",
        "Actively contributed to an existing production-grade Flutter project, assisting in feature development and enhancing user interface components."
      ]
    },
    {
      "organization": "HealthX BD",
      "org_short": "HealthX",
      "position": "Intern Software Engineer",
      "start": "April 2022",
      "end": "August 2022",
      "type": "Internship",
      "location": "Dhaka, Bangladesh",
      "detail": [
        "Worked on a Doctor and Patient portal to support appointment scheduling and chamber management with individual profiling features.",
        "Designed user interfaces and integrated APIs as per functional requirements."
      ]
    }
  ],
  "education": [
    {
      "type": "Graduation",
      "degree": "B.Sc in Computer Science & Engineering",
      "institute": "Daffodil International University",
      "start": "January 2018",
      "end": "January 2022",
      "location": "Dhaka, Bangladesh"
    }
  ]
}
